In [43]:
# import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [44]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\k33rt\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\k33rt\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [45]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection
              
# put our MySQL Terminal password
pw = "k33rth1@K"
# Database name
db = "mysql_python"
connection = create_server_connection("localhost", "root",pw)

MySQL Database connection successful

In [46]:
# Create mysql_python

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database create successfully")
    except Error as err:
        print(f"Error:'{err}'")
create_database_query = "Create database mysql_python"
create_database(connection,create_database_query)

Error:'1007 (HY000): Can't create database 'mysql_python'; database exists'

In [47]:
# connect to database
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print("MySQL database connection successfull")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [48]:
#Execute sql queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: '{err}'")

In [62]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_print float,
phone_number varchar(20));
"""
 # connect to the database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successfull
Error: '1050 (42S01): Table 'orders' already exists'

In [50]:
# insert data
data_orders = """
insert into orders values
(101, 'Steve','Laptop','2018-06-12', 3, 600,'75839380937'),
(102, 'Emily', 'Desktop', '2019-02-28', 5, 800, '98274582738'),
(103, 'Michael', 'Tablet', '2020-09-15', 2, 350, '62518472948'),
(104, 'Jessica', 'Smartphone', '2021-04-03', 1, 500, '81374918472'),
(105, 'Andrew', 'Laptop', '2017-11-20', 4, 700, '45832749183'),
(106, 'Sophia', 'Desktop', '2018-08-05', 6, 850, '91284759473');
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL database connection successfull
Error: '1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY''

In [51]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [52]:
# using the select stmt
q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 3, 600.0, '75839380937')
(102, 'Emily', 'Desktop', datetime.date(2019, 2, 28), 5, 800.0, '98274582738')
(103, 'Michael', 'Tablet', datetime.date(2020, 9, 15), 2, 350.0, '62518472948')
(104, 'Jessica', 'Smartphone', datetime.date(2021, 4, 3), 1, 500.0, '81374918472')
(105, 'Andrew', 'Laptop', datetime.date(2017, 11, 20), 4, 700.0, '45832749183')
(106, 'Sophia', 'Desktop', datetime.date(2018, 8, 5), 6, 850.0, '91284759473')

In [53]:
# using the select stmt
q1 = """
select customer_name,phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
('Steve', '75839380937')
('Emily', '98274582738')
('Michael', '62518472948')
('Jessica', '81374918472')
('Andrew', '45832749183')
('Sophia', '91284759473')

In [54]:
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2020,)
(2021,)
(2017,)
(2018,)

In [55]:
q4 = """
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2020,)
(2021,)
(2017,)

In [56]:
q5 = """
select * from orders where date_ordered < '2018-12-31'
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 3, 600.0, '75839380937')
(105, 'Andrew', 'Laptop', datetime.date(2017, 11, 20), 4, 700.0, '45832749183')
(106, 'Sophia', 'Desktop', datetime.date(2018, 8, 5), 6, 850.0, '91284759473')

In [57]:
q6 = """
select * from orders where date_ordered > '2018-12-31'
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successfull
(102, 'Emily', 'Desktop', datetime.date(2019, 2, 28), 5, 800.0, '98274582738')
(103, 'Michael', 'Tablet', datetime.date(2020, 9, 15), 2, 350.0, '62518472948')
(104, 'Jessica', 'Smartphone', datetime.date(2021, 4, 3), 1, 500.0, '81374918472')

In [61]:
q7 = """
select * from orders order by unit_print;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL database connection successfull
(103, 'Michael', 'Tablet', datetime.date(2020, 9, 15), 2, 350.0, '62518472948')
(104, 'Jessica', 'Smartphone', datetime.date(2021, 4, 3), 1, 500.0, '81374918472')
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 3, 600.0, '75839380937')
(105, 'Andrew', 'Laptop', datetime.date(2017, 11, 20), 4, 700.0, '45832749183')
(102, 'Emily', 'Desktop', datetime.date(2019, 2, 28), 5, 800.0, '98274582738')
(106, 'Sophia', 'Desktop', datetime.date(2018, 8, 5), 6, 850.0, '91284759473')

In [65]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "phone_number"]
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,103,Michael,Tablet,2020-09-15,2,350.0,62518472948
1,104,Jessica,Smartphone,2021-04-03,1,500.0,81374918472
2,101,Steve,Laptop,2018-06-12,3,600.0,75839380937
3,105,Andrew,Laptop,2017-11-20,4,700.0,45832749183
4,102,Emily,Desktop,2019-02-28,5,800.0,98274582738
5,106,Sophia,Desktop,2018-08-05,6,850.0,91284759473

In [66]:
# Update command
update = """
update orders
set unit_print = 45
where order_id = 103
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySQL database connection successfull
Query was successful

In [67]:
q8 = """
select * from orders where order_id = 103;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successfull
(103, 'Michael', 'Tablet', datetime.date(2020, 9, 15), 2, 45.0, '62518472948')

In [70]:
#Delete command
delete_order = """
delete from orders
where order_id = 105;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySQL database connection successfull
Query was successful

In [71]:
q8 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 3, 600.0, '75839380937')
(102, 'Emily', 'Desktop', datetime.date(2019, 2, 28), 5, 800.0, '98274582738')
(103, 'Michael', 'Tablet', datetime.date(2020, 9, 15), 2, 45.0, '62518472948')
(104, 'Jessica', 'Smartphone', datetime.date(2021, 4, 3), 1, 500.0, '81374918472')
(106, 'Sophia', 'Desktop', datetime.date(2018, 8, 5), 6, 850.0, '91284759473')